


/*
begin tran  --Если с самого начала создаётся на с ID равным = 1, то можно обновить таблицу с помощью процы, и заполнить таблицу.
if exists 
	  (	  
	  	SELECT name,last_value 
	  	FROM sys.identity_columns 
	  	WHERE object_id = OBJECT_ID('dbo.Branch') 
	  		AND last_value IS not NULL 	  
	  )
	  begin
	  DBCC CHECKIDENT ('dbo.Branch', RESEED, 0)
	  end
--rollback
SELECT name,last_value 
FROM sys.identity_columns 
WHERE object_id = OBJECT_ID('dbo.Branch')
commit
go
*/

-- select * from Branch
-- delete from  Branch where id_Branch is not null


/*
Требуется Построчно, по указанным странам и идентификаторам к ним, указать списком по 10 случайных городов каждой страны. 
Вывести нужно Указанный  идентификатор и напротив сгенерированный город в одинарных кавычках,
к каждому городу указать случайный адрес из этого города в одинарных кавычках, наименование случайной организации в одинарных кавычках
,2,Австрия,7,Ангилья,17,Беларусь,19,Бельгия,21,Болгария,27,Ватикан,28,Венгрия,30,Вьетнам
,31,Габон,32,Гаити,33,Гана,34,Греция,36,Грузия,37,Дания,41,Египет,42,Замбия,44,Индия,47,Ирландия,48,Исландия
,49,Испания,50,Италия,52,Казахстан,53,Канаду,56,Кипр,57,Киргизия,58,Китай,65,Лаос,66,Латвия,67,Лесото
,68,Литва,74,Мали,76,Мальта,77,Мексика,78,Молдова,79,Монако,80,Монголия,83,Непал,84,Нигер,87,Норвегия
,89,Оман,90,Пакистан,96,Россия,97,Румыния,98,100,Сингапур,101,Словакия,102,Словения
,103,Сомали,104,Судан,106,Таиланд,107,Тайвань,111,Турция,112,Уганда,121,Чад,122,Чехия,123,Чили,125,Швеция
,128,Эстония,131,Япония. Сделать по всем странам.
*/



--Добавил в конце (round(rand()*999999999,0)) формирование рандомного инн
use  Magaz_DB
go
set nocount,xact_abort on;
begin tran
insert into Branch  (Id_Country,City,[Address],Name_Branch,INN) values 
(2, 'Вена', 'ул. Штефан-Платц, 1', 'Cafe Central'                                           ,(round(rand()*999999999,0))),
(2, 'Грац', 'Плошад Кайнза, 3', 'MuseumsQuartier'                                           ,(round(rand()*999999999,0))),
(2, 'Инсбрук', 'Тирольская ул., 1', 'Alpenzoo Innsbruck'									,(round(rand()*999999999,0))),
(2, 'Линц', 'Ул. Нернсдорфер, 12', 'Ars Electronica Center'									,(round(rand()*999999999,0))),
(2, 'Зальцбург', 'Мирбельгasse, 5', 'Mozart’s Birthplace'									,(round(rand()*999999999,0))),
(2, 'Клагенфурт', 'Ул. Кайзеров, 7', 'Wörthersee Stadion'									,(round(rand()*999999999,0))),
(2, 'Вельс', 'Плошад Битца, 6', 'Heldendenkmal'												,(round(rand()*999999999,0))),
(2, 'Швехат', 'Ул. Слотицких, 8', 'Shopping City Süd'										,(round(rand()*999999999,0))),
(2, 'Бургленд', 'Ул. Мададея, 14', 'Therme Linsberg Asia'									,(round(rand()*999999999,0))),
(2, 'Ландек', 'Ул. Польгейтакер, 9', 'Heiliggeistkirche'									,(round(rand()*999999999,0))),
(7, 'Кросдейл', 'Старый Район, 32', 'Tropical Breeze Resort'								,(round(rand()*999999999,0))),
(7, 'Сэндли', 'Ул. Лос-Вегас, 20', 'Azure Sands Hotel'										,(round(rand()*999999999,0))),
(7, 'Бланшард', 'Ул. Прекрасного Леса, 4', 'Coral Springs Community Center'					,(round(rand()*999999999,0))),
(7, 'Мэригорд', 'Река Боун, 17', 'Distant Shores Spa'										,(round(rand()*999999999,0))),
(7, 'Эбен-Хейд', 'На берегу, 11', 'Sunnyville Bakery'										,(round(rand()*999999999,0))),
(7, 'Фламинго', 'Ул. Чудесных Восходов, 9', 'Flamingo Seafood'								,(round(rand()*999999999,0))),
(7, 'Кемп-дю-Лак', 'Ул. Головокружительной Ночи, 25', 'Mountain Views Resort'				,(round(rand()*999999999,0))),
(7, 'Бэймонт', 'Ул. Солнечного Заката, 8', 'Sunshine International'							,(round(rand()*999999999,0))),
(7, 'Слоновое Ушко', 'Ул. Ясного Неба, 13', 'Ocean Breeze'									,(round(rand()*999999999,0))),
(7, 'Дилетант' , 'Старый Бульвар, 3', 'Visions Art Studio'									,(round(rand()*999999999,0))),
(17, 'Минск', 'ул. Независимости, 12', 'Магазин электроники'								,(round(rand()*999999999,0))),
(17, 'Гродно', 'пл. Ленина, 5', 'Кафе Гродно'												,(round(rand()*999999999,0))),
(17, 'Брест', 'ул. Советская, 7', 'Брестская крепость'										,(round(rand()*999999999,0))),
(17, 'Могилёв', 'ул. Гагарина, 9', 'Кинотеатр Победа'										,(round(rand()*999999999,0))),
(17, 'Витебск', 'пл. Победы, 2', 'Витебская филармония'										,(round(rand()*999999999,0))),
(17, 'Гомель', 'ул. Барыкина, 15', 'Гомельский замок'										,(round(rand()*999999999,0))),
(17, 'Солигорск', 'ул. Центральная, 1', 'Кафе Привет'										,(round(rand()*999999999,0))),
(17, 'Бобруйск', 'ул. Орловская, 5', 'Музей Бобруйска'										,(round(rand()*999999999,0))),
(17, 'Пинск', 'ул. Ленина, 6', 'Каминный зал'												,(round(rand()*999999999,0))),
(17, 'Светлогорск', 'ул. Маяковского, 10', 'Магазин солнечных очков'						,(round(rand()*999999999,0))),
(19, 'Брюссель', 'пл. Сукане, 1', 'Шоколадная лавка'										,(round(rand()*999999999,0))),
(19, 'Антверпен', 'ул. Культофрейм, 7', 'Алмазная биржа'									,(round(rand()*999999999,0))),
(19, 'Гент', 'ул. Фламандская гулли, 3', 'Санкт-Бавона'										,(round(rand()*999999999,0))),
(19, 'Брюгге', 'ул. Кувелье, 11', 'Бельгийская пивоварня'									,(round(rand()*999999999,0))),
(19, 'Льеж', 'ул. Любезных, 5', 'Музей Леопольда'											,(round(rand()*999999999,0))),
(19, 'Лугано', 'ул. Солнечной, 4', 'Луганский архив'										,(round(rand()*999999999,0))),
(19, 'Тревизо', 'ул. Ледяной, 8', 'Sports Plaza'											,(round(rand()*999999999,0))),
(19, 'Мехелен', 'ул. Гелльт, 15', 'Круглый стол'											,(round(rand()*999999999,0))),
(19, 'Шарлеруа', 'ул. Вирлина, 2', 'Театр Шарлеруа'											,(round(rand()*999999999,0))),
(19, 'Намюр', 'пл. Ламброзу, 6', 'Кинотеатр Лиона'											,(round(rand()*999999999,0))),
(21, 'София', 'ул. Витоша, 39', 'Кафе Яуза'													,(round(rand()*999999999,0))),
(21, 'Пловдив', 'ул. Капитан Райчо, 4', 'Исторический музей'								,(round(rand()*999999999,0))),
(21, 'Варна', 'ул. Приморская, 11', 'Морской сад'											,(round(rand()*999999999,0))),
(21, 'Бургас', 'ул. Бургаская, 8', 'Морской порт'											,(round(rand()*999999999,0))),
(21, 'Русе', 'ул. Широкая, 5', 'Бельведер'													,(round(rand()*999999999,0))),
(21, 'Стара Загора', 'ул. Пролетарская, 16', 'Римский стадион'								,(round(rand()*999999999,0))),
(21, 'Добрич', 'ул. Добруджанская, 22', 'Парк Победы'										,(round(rand()*999999999,0))),
(21, 'Сливен', 'ул. Освобождения, 12', 'Церковь Святой Софии'								,(round(rand()*999999999,0))),
(21, 'Перник', 'ул. Новой луджи, 9', 'Городской спорткомплекс'								,(round(rand()*999999999,0))),
(21, 'Шумен', 'ул. Тракийская, 10', 'Кафе парковое'											,(round(rand()*999999999,0))),
(27, 'Ватикан', 'ул. Святого Петра, 1', 'Секретариат Святого Престола'						,(round(rand()*999999999,0))),
(27, 'Рим', 'ул. Форум, 14', 'Куланго'														,(round(rand()*999999999,0))),
(27, 'Асколи-Пичено', 'ул. Бенедикто, 21', 'Курия'											,(round(rand()*999999999,0))),
(27, 'Треви', 'ул. фонтанная, 7', 'Треви-капелла'											,(round(rand()*999999999,0))),
(27, 'Римини', 'ул. Виа, 10', 'Пьетро'														,(round(rand()*999999999,0))),
(27, 'Неаполь', 'ул. Мерказу, 9', 'Сакра Капеле'											,(round(rand()*999999999,0))),
(27, 'Тоскана', 'ул. Пресвятой, 13', 'Тосканская Осень'										,(round(rand()*999999999,0))),
(27, 'Флоренция', 'ул. Лоренцо, 19', 'Флоренция Сияния'										,(round(rand()*999999999,0))),
(27, 'Сиена', 'ул. Собора, 5', 'Вилла Иги'													,(round(rand()*999999999,0))),
(27, 'Болонья', 'ул. Теплова, 28', 'Теннери'												,(round(rand()*999999999,0))),
(28, 'Будапешт', 'ул. Ваци, 23', 'Сенат'													,(round(rand()*999999999,0))),
(28, 'Дебрецен', 'ул. Тертле, 10', 'Площадь Лайоса'											,(round(rand()*999999999,0))),
(28, 'Сегед', 'ул. Торвальда, 5', 'Сегедская Конфессия'										,(round(rand()*999999999,0))),
(28, 'Мишкольц', 'ул. Абдрея, 15', 'Гражданский центр'										,(round(rand()*999999999,0))),
(28, 'Печ', 'ул. Хольцер, 12', 'Печиньские танцы'											,(round(rand()*999999999,0))),
(28, 'Шопрон', 'ул. Хунгари, 7', 'Термы Ньирьхаз'											,(round(rand()*999999999,0))),
(28, 'Капошвар', 'ул. Сечет, 3', 'Район Хаус'												,(round(rand()*999999999,0))),
(28, 'Ньиредьхаз', 'ул. Тинкера, 20', 'Космическая площадь'									,(round(rand()*999999999,0))),
(28, 'Залакарош', 'ул. Зала, 1', 'Парусные гонки'											,(round(rand()*999999999,0))),
(28, 'Сомбате́й', 'ул. Великого, 5', 'Фейерверк джи'											,(round(rand()*999999999,0))),
(30, 'Ханой', 'ул. Лун, 16', 'Cafe Viet'													,(round(rand()*999999999,0))),
(30, 'Хошимин', 'ул. Малайзийская, 4', 'Турагенство'										,(round(rand()*999999999,0))),
(30, 'Дананг', 'ул. Да Ка, 17', 'Тибетская кухня'											,(round(rand()*999999999,0))),
(30, 'Нha Транг', 'ул. Лос-Остыль, 12', 'Соломоновский паб'									,(round(rand()*999999999,0))),
(30, 'Хайфонг', 'ул. Зелёная, 12', 'Дворой'													,(round(rand()*999999999,0))),
(30, 'Сайгон', 'ул. Садовая, 6', 'Западные витки'											,(round(rand()*999999999,0))),
(30, 'Вьетнам', 'ул. Солнца, 13', 'Студия номер один'										,(round(rand()*999999999,0))),
(30, 'Ниньбинь', 'ул. Бортаи, 7', 'Гарден кафе'												,(round(rand()*999999999,0))),
(30, 'Сапа', 'ул. Бенгровая, 2', 'Рататуй'													,(round(rand()*999999999,0))),
(30, 'Муйне', 'ул. Мировой, 1', 'Судец Старого мира'										,(round(rand()*999999999,0))),
(31, 'Либревиль', 'ул. Блан, 9', 'Центр Габона'												,(round(rand()*999999999,0))),
(31, 'Френшвиль', 'ул. Мира, 8', 'Национальный музей'										,(round(rand()*999999999,0))),
(31, 'Овандо', 'ул. Солнечных дня, 2', 'Габонский авангард'									,(round(rand()*999999999,0))),
(31, 'Майонг' , 'ул. Лунная, 4', 'Кафе Мелодии'												,(round(rand()*999999999,0))),
(31, 'Уэли' , 'ул. Океанская, 7', 'Футбольный клуб'											,(round(rand()*999999999,0))),
(31, 'Ангар' , 'ул. Наморская, 1', 'Новое вдохновение'										,(round(rand()*999999999,0))),
(31, 'Нсылиндза' , 'ул. Сапфировая, 10', 'Творческий кластер'								,(round(rand()*999999999,0))),
(31, 'Гуа' , 'ул. Гора, 3', 'Спортивная лига'												,(round(rand()*999999999,0))),
(31, 'Бите' , 'ул. Леса, 22', 'Школа искусств'												,(round(rand()*999999999,0))),
(31, 'Тшане' , 'ул. Премьера, 4', 'Кофейня Норман'											,(round(rand()*999999999,0))),
(32, 'Порт-о-Пренс', 'ул. Чирка, 15', 'Музей Гаити'											,(round(rand()*999999999,0))),
(32, 'Кап-Айтьен', 'ул. Жимаха, 12', 'Кафе Ривер'											,(round(rand()*999999999,0))),
(32, 'Жакмель', 'ул. Плутус, 10', 'Бельмонт'												,(round(rand()*999999999,0))),
(32, 'Леоган', 'ул. Кемпер, 9', 'Забава'													,(round(rand()*999999999,0))),
(32, 'Канзас', 'ул. Равенчроба, 20', 'Национальный дворец'									,(round(rand()*999999999,0))),
(32, 'Лимонье', 'ул. Тетани, 16', 'Кампус Святого Григория'									,(round(rand()*999999999,0))),
(32, 'Плавнёр' , 'ул. Валерийская, 8', 'Кучерята'											,(round(rand()*999999999,0))),
(32, 'Авриль' , 'ул. Кауто, 1', 'Тайные искусства'											,(round(rand()*999999999,0))),
(32, 'Селдре' , 'ул. Апти 18, 25', 'Прямой путь'											,(round(rand()*999999999,0))),
(32, 'Петито' , 'ул. Дверко, 5', 'Пиршество'												,(round(rand()*999999999,0))),
(33, 'Аккра', 'ул. Аутограба, 24', 'Арт-центр'												,(round(rand()*999999999,0))),
(33, 'Кумаси', 'ул. Заветы, 9', 'Сандовил'													,(round(rand()*999999999,0))),
(33, 'Тема', 'ул. Лотосовая, 11', 'Клубной Темы'											,(round(rand()*999999999,0))),
(33, 'Кумаси', 'ул. Жемчужная, 21', 'Гостиница Радуга'										,(round(rand()*999999999,0))),
(33, 'Такоради', 'ул. Кладбищенская, 3', 'Фестиваль красок'									,(round(rand()*999999999,0))),
(33, 'Элеманту', 'ул. Лина, 20', 'Национальный дом'											,(round(rand()*999999999,0))),
(33, 'Джирниабон', 'ул. Искусство, 4', 'КЛК Мастеров'										,(round(rand()*999999999,0))),
(33, 'Чанго', 'ул. Лабо, 7', 'Центр Общины'													,(round(rand()*999999999,0))),
(33, 'Насанго', 'ул. Хартту, 15', 'Школа художников'										,(round(rand()*999999999,0))),
(33, 'Дукоме' , 'ул. Аваллон, 14', 'Кулинарные традиции'									,(round(rand()*999999999,0))),
(34, 'Афины', 'ул. Соцветий, 25', 'Афинея'													,(round(rand()*999999999,0))),
(34, 'Салоники', 'ул. Руководящих духом, 19', 'Центр Администраций'							,(round(rand()*999999999,0))),
(34, 'Патры', 'ул. Ипполита, 13', 'Фрагменты Нагорной'										,(round(rand()*999999999,0))),
(34, 'Ираклион', 'ул. Образовательная, 8', 'Туроператор'									,(round(rand()*999999999,0))),
(34, 'Делфи', 'ул. Левуни, 1', 'Культурный центр'											,(round(rand()*999999999,0))),
(34, 'Ретимно', 'ул. Солнечная, 12', 'Кофейня Старая'										,(round(rand()*999999999,0))),
(34, 'Керкира', 'ул. Ораторская, 29', 'Пирамида'											,(round(rand()*999999999,0))),
(34, 'Ханья', 'ул. Калипсо, 3', 'Музей доминирования'										,(round(rand()*999999999,0))),
(34, 'Каливи' , 'ул. Графикар, 4', 'Кошачий дом'											,(round(rand()*999999999,0))),
(34, 'Замверце' , 'ул. Паула, 22', 'Анилизации'												,(round(rand()*999999999,0))),
(36, 'Тбилиси', 'ул. Руставели, 28', 'Тбилисский магнат'									,(round(rand()*999999999,0))),
(36, 'Батуми', 'ул. Олимпийская, 9', 'Футбольный клуб'										,(round(rand()*999999999,0))),
(36, 'Кутаиси', 'ул. Бережок, 7', 'Красное озеро'											,(round(rand()*999999999,0))),
(36, 'Зугдиди', 'ул. Кобаладзе, 18', 'Ноев ковчег'											,(round(rand()*999999999,0))),
(36, 'Рустави', 'ул. Буяка, 12', 'Центр фестивалей'											,(round(rand()*999999999,0))),
(36, 'Зестафони' , 'ул. Босоножек, 14', 'Семья'												,(round(rand()*999999999,0))),
(36, 'Ткибули' , 'ул. Барышевская, 5', 'Спорт'												,(round(rand()*999999999,0))),
(36, 'Гори' , 'ул. Гували, 22', 'Кафе Мосты'												,(round(rand()*999999999,0))),
(36, 'Джвари' , 'ул. Солнце, 30', 'Культурный сообщественный центр'							,(round(rand()*999999999,0))),
(36, 'Ахалцихе' , 'ул. Толефон, 8', 'Гнездо'												,(round(rand()*999999999,0))),
(37, 'Копенгаген', 'ул. Гамле, 12', 'Кафе Гарден '											,(round(rand()*999999999,0))),
(37, 'Оденсе', 'ул. Сена, 17', 'Морской контракт'											,(round(rand()*999999999,0))),
(37, 'Ааргус', 'ул. Стратенгаден, 8', 'Пешеходный центр'									,(round(rand()*999999999,0))),
(37, 'Вейле', 'ул. Ниллига на поле, 3', 'Фестиваль Дании'									,(round(rand()*999999999,0))),
(37, 'Хернинг', 'ул. Хамперо, 6', 'Национальный обиходный'									,(round(rand()*999999999,0))),
(37, 'Силея' , 'ул. Пример, 9', 'Домен Гетти'												,(round(rand()*999999999,0))),
(37, 'Скандеборг' , 'ул. Сконжи, 11', 'Кафе Бриггит'										,(round(rand()*999999999,0))),
(37, 'Целлдес' , 'ул. Нэймд Кайтке, 16', 'Нгейбсцлавех'										,(round(rand()*999999999,0))),
(37, 'Хингслевт' , 'ул. Молтеккер, 22', 'Росси'												,(round(rand()*999999999,0))),
(37, 'Гравер' , 'ул. Вико, 5', 'Аскадаль'													,(round(rand()*999999999,0))),
(41, 'Каир', 'ул. Мермута, 14', 'Африканский центр'											,(round(rand()*999999999,0))),
(41, 'Гиза', 'ул. Комплекс, 3', 'Гигантский поросенок'										,(round(rand()*999999999,0))),
(41, 'Луксор', 'ул. Господина, 20', 'Темпл Анкли'											,(round(rand()*999999999,0))),
(41, 'Александрия', 'ул. Глазбоя, 11', 'Кофейня Будущее'									,(round(rand()*999999999,0))),
(41, 'Порт-Саид', 'ул. Портовая, 23', 'Кафе Кракен'											,(round(rand()*999999999,0))),
(41, 'Шарм-Эль-Шейх', 'ул. Аргасева, 17', 'Кинотеатр Марант'								,(round(rand()*999999999,0))),
(41, 'Ассут', 'ул. Пастора, 19', 'Египетская картина'										,(round(rand()*999999999,0))),
(41, 'Асуан', 'ул. Нокс, 22', 'Находка'														,(round(rand()*999999999,0))),
(41, 'Танта', 'ул. Адвокат, 9', 'Река Леон' 												,(round(rand()*999999999,0))),
(41, 'Хургада', 'ул. Водяного, 15', 'Кафе Сафари'											,(round(rand()*999999999,0))),
(42, 'Лусака', 'ул. Джуни, 3', 'Центр одежды'												,(round(rand()*999999999,0))),
(42, 'Коппербелт', 'ул. Долорес, 7', 'Музей'												,(round(rand()*999999999,0))),
(42, 'Солвера', 'ул. Прыжка, 25', 'Сказка о числах'											,(round(rand()*999999999,0))),
(42, 'Ндола', 'ул. Ламбрет, 11', 'Галерея'													,(round(rand()*999999999,0))),
(42, 'Мзузу', 'ул. Сталинграда, 30', 'Маскарад'												,(round(rand()*999999999,0))),
(42, 'Касама', 'ул. Баракова, 20', 'Комната тишины'											,(round(rand()*999999999,0))),
(42, 'Чипата', 'ул. Ферейнта, 12', 'Загадка'												,(round(rand()*999999999,0))),
(42, 'Чарди', 'ул. Лемур, 19', 'Поездка в Льва'												,(round(rand()*999999999,0))),
(42, 'Паула', 'ул. Хана, 8', 'Супер-маркет'													,(round(rand()*999999999,0))),
(42, 'Соломо', 'ул. Кубларова, 13', 'Школа सजरेशन'											,(round(rand()*999999999,0))),
(44, 'Нью-Дели', 'ул. Конгресс, 40', 'Cafe Coffee Day'										,(round(rand()*999999999,0))),
(44, 'Мумбаи', 'ул. Чаттри, 24', 'Flavors Cafe'												,(round(rand()*999999999,0))),
(44, 'Бангалор', 'ул. Мадохбх, 15', 'Art Gallery'											,(round(rand()*999999999,0))),
(44, 'Хайдарабад', 'ул. Налападир, 29', 'Cafe Nook'											,(round(rand()*999999999,0))),
(44, 'Ченнай', 'ул. Рамкамал, 8', 'Royal Palace'											,(round(rand()*999999999,0))),
(44, 'Коимбатор', 'Ул. Трайвани, 12', 'Nasi lemak'											,(round(rand()*999999999,0))),
(44, 'Калькутта', 'ул. Гирдон, 29', 'Tea House'												,(round(rand()*999999999,0))),
(44, 'Гудапери', 'ул. Шиванга, 4', 'Kok Sar'												,(round(rand()*999999999,0))),
(44, 'Пуне', 'ул. Келлі, 18', 'Fortress of Fortune'											,(round(rand()*999999999,0))),
(44, 'Дели', 'ул. Эльгейти, 11', 'Ice Cream Kingdom'										,(round(rand()*999999999,0))),
(47, 'Дублин', 'ул. Килларни, 13', 'Дублинский замок'										,(round(rand()*999999999,0))),
(47, 'Корк', 'ул. Котта, 19', 'Корковский Старый'											,(round(rand()*999999999,0))),
(47, 'Голвей', 'ул. Келли, 22', 'Магазин Светелка'											,(round(rand()*999999999,0))),
(47, 'Лимерик', 'ул. Мерси, 4', 'Галерея Естер'												,(round(rand()*999999999,0))),
(47, 'Слайго', 'ул. Пьюзга, 11', 'Неизвестный Царь'											,(round(rand()*999999999,0))),
(47, 'Уотерфорд', 'ул. Фмтрана, 25', 'Астрациянские Мифы'									,(round(rand()*999999999,0))),
(47, 'Вексфорд', 'ул. Избрание, 2', 'Морская Стена'											,(round(rand()*999999999,0))),
(47, 'Кромайк', 'ул. Офегра, 18', 'Свет над призраками'										,(round(rand()*999999999,0))),
(47, 'Кароджика', 'ул. Быстрота, 16', 'Отель Станка'										,(round(rand()*999999999,0))),
(47, 'Мейвилд', 'ул. Знайдер, 32', 'Тату-артистка Айра'										,(round(rand()*999999999,0))),
(48, 'Рейкьявик', 'ул. Льда, 1', 'Cafe Bla'													,(round(rand()*999999999,0))),
(48, 'Копавогюр', 'ул. Фьятр, 10', 'Солнечный ветер'										,(round(rand()*999999999,0))),
(48, 'Акюрейри', 'ул. Нордсаль, 32', 'Дельта'												,(round(rand()*999999999,0))),
(48, 'Снайфедльснесс', 'ул. Лунная, 9', 'Сорок Дев' 										,(round(rand()*999999999,0))),
(48, 'Хусавик', 'ул. Клявич, 7', 'Свет Дорннара'											,(round(rand()*999999999,0))),
(48, 'Гардар' , 'ул. Мирной, 3', 'Кафе Согласия'											,(round(rand()*999999999,0))),
(48, 'Грюдберг' , 'ул. Лесной, 12', 'Типа'													,(round(rand()*999999999,0))),
(48, 'Дейпивогюр' , 'ул. Маяка, 2', 'Книга Рекордов'										,(round(rand()*999999999,0))),
(48, 'Эгильстадир' , 'ул. Жемчуг, 4', 'Творческие пути'										,(round(rand()*999999999,0))),
(48, 'Фладесвагур' , 'ул. Фьельд, 13', 'Пустынные огни'										,(round(rand()*999999999,0))),
(49, 'Мадрид', 'ул. Гранде, 43', 'El Corte Inglés'											,(round(rand()*999999999,0))),
(49, 'Барселона', 'ул. Лампа, 8', 'La Boqueria'												,(round(rand()*999999999,0))),
(49, 'Валенсия', 'ул. Сьерра, 15', 'Mercado Central'										,(round(rand()*999999999,0))),
(49, 'Севилья', 'ул. Марифко, 21', 'Real Alcázar'											,(round(rand()*999999999,0))),
(49, 'Малага', 'ул. Лас-Каланки, 20', 'Picasso Museum'										,(round(rand()*999999999,0))),
(49, 'Сарагоса', 'ул. Ибсена, 25', 'Площадь Пьедад'											,(round(rand()*999999999,0))),
(49, 'Вик', 'ул. Сервантес, 11', 'Кафе Сервантес'											,(round(rand()*999999999,0))),
(49, 'Кадис', 'ул. Замечательный, 5', 'La Merced'											,(round(rand()*999999999,0))),
(49, 'Санта-Крус-де-Тенерифе', 'ул. Норден, 20', 'Террасы Роттерама'						,(round(rand()*999999999,0))),
(49, 'Аликанте', 'ул. Теплофф, 8', 'Posidonia'												,(round(rand()*999999999,0))),
(50, 'Рим', 'ул. Ватикана, 1', 'Римский зал'												,(round(rand()*999999999,0))),
(50, 'Милан', 'ул. Графика, 14', 'Популярный рынок'											,(round(rand()*999999999,0))),
(50, 'Венеция', 'ул. Канала, 1', 'Мост Вздохов'												,(round(rand()*999999999,0))),
(50, 'Неаполь', 'ул. Санта-Мария, 19', 'Пиццерия Пьяццалин'									,(round(rand()*999999999,0))),
(50, 'Турин', 'ул. Верди, 24', 'Проблемы Вин'												,(round(rand()*999999999,0))),
(50, 'Флоренция', 'ул. Нельсана, 5', 'Галерея Уффици'										,(round(rand()*999999999,0))),
(50, 'Сиена', 'ул. Кремонз, 6', 'Ресторан Боска'											,(round(rand()*999999999,0))),
(50, 'Болонья', 'ул. Фрумат, 21', 'Британский парламент'									,(round(rand()*999999999,0))),
(50, 'Палермо', 'ул. Доливаира, 7', 'Лациус'												,(round(rand()*999999999,0))),
(50, 'Лечче', 'ул. Траппила, 4', 'Кулинарная академия'										,(round(rand()*999999999,0))),
(52, 'Алматы', 'ул. Сатпаева, 45', 'Казахстанская газета'									,(round(rand()*999999999,0))),
(52, 'Нур-Султан', 'ул. Тауелсиздик, 7', 'Главный офис'										,(round(rand()*999999999,0))),
(52, 'Шымкент', 'ул. Парк имени Аубакирова, 56', 'Школа искусств'							,(round(rand()*999999999,0))),
(52, 'Караганда', 'ул. Центральная, 30', 'Клиент'											,(round(rand()*999999999,0))),
(52, 'Актау', 'ул. Лесная, 24', 'Галерея'													,(round(rand()*999999999,0))),
(52, 'Атырау', 'ул. Фасолья, 3', 'Совет хозяйки'											,(round(rand()*999999999,0))),
(52, 'Павлодар', 'ул. Депутатская, 20', 'Альтернативный бизнес'								,(round(rand()*999999999,0))),
(52, 'Усть-Каменогорск', 'ул. Мостовая, 18', 'Экономика'									,(round(rand()*999999999,0))),
(52, 'Семей', 'ул. Птицеград, 22', 'Эксперт'												,(round(rand()*999999999,0))),
(52, 'Талдыкорган', 'ул. Талгат, 21', 'Экология'											,(round(rand()*999999999,0))),
(53, 'Оттава', 'улица Причал, 30', 'Канады Идеи'											,(round(rand()*999999999,0))),
(53, 'Торонто', 'улица Она, 50', 'Кока-кола'												,(round(rand()*999999999,0))),
(53, 'Ванкувер', 'перекога Дельта, 70', 'Пудра Групп'										,(round(rand()*999999999,0))),
(53, 'Монреаль', 'площадь Бизации, 9', 'Шикарный Час'										,(round(rand()*999999999,0))),
(53, 'Калгари', 'ул. Мандрит, 2', 'Гардероб Успеха'											,(round(rand()*999999999,0))),
(53, 'Квебек', 'ул. Святого Иосифа, 44', 'Библиотека искусства'								,(round(rand()*999999999,0))),
(53, 'Виктория', 'перекрёсток Седан, 22', 'Карбастер Стайл'									,(round(rand()*999999999,0))),
(53, 'Едмотон', 'улица Мербар, 33', 'Лимон'													,(round(rand()*999999999,0))),
(53, 'Ошава', 'ул. Полоска, 7', 'Завод Солнечных технологий'								,(round(rand()*999999999,0))),
(53, 'Виннипег', 'улица Устрицы, 15', 'Виноге'												,(round(rand()*999999999,0))),
(56, 'Никосия', 'ул. Мариуполь, 9', 'Кипрская печка'										,(round(rand()*999999999,0))),
(56, 'Лимассол', 'ул. Корейская, 8', 'Курорты'												,(round(rand()*999999999,0))),
(56, 'Ларнака', 'ул. Вита, 22', 'Крыше'														,(round(rand()*999999999,0))),
(56, 'Фамагуста', 'ул. Араски, 5', 'Тайный зал'												,(round(rand()*999999999,0))),
(56, 'Пафос', 'ул. Михайловская, 15', 'Кофе-чай'											,(round(rand()*999999999,0))),
(56, 'Кирения', 'ул. Мечты, 21', 'Виноградная пята'											,(round(rand()*999999999,0))),
(56, 'Кирранья', 'ул. Метель, 4', 'Лучше вместе'											,(round(rand()*999999999,0))),
(56, 'Сольферино', 'ул. Невозвратной, 16', 'Кукушка'										,(round(rand()*999999999,0))),
(56, 'Агтода', 'ул. Нечай, 14', 'Кофе Эспрессо'												,(round(rand()*999999999,0))),
(56, 'Вивос' , 'ул. Студентская, 10', 'Тайна'												,(round(rand()*999999999,0))),
(57, 'Ош', 'ул.Ажара, 19', 'Кафе Сысоев'													,(round(rand()*999999999,0))),
(57, 'Бишкек', 'ул. Нукус, 21', 'Vintage Center'											,(round(rand()*999999999,0))),
(57, 'Талас', 'ул. Ленинская, 28', 'Галерея Краски'											,(round(rand()*999999999,0))),
(57, 'Нарын', 'ул. Треугольная, 12', 'Будда'												,(round(rand()*999999999,0))),
(57, 'Узбекистан', 'ул. Седир, 5', 'Талд СТК'												,(round(rand()*999999999,0))),
(57, 'Каракол', 'ул. Ашта, 14', 'Снежные склоны'											,(round(rand()*999999999,0))),
(57, 'Жалалабад', 'ул. Великого Ислама, 18', 'Садочкодержатель'								,(round(rand()*999999999,0))),
(57, 'Чолпон-Ата', 'ул. Чеченская, 28', 'Пункт раздачи'										,(round(rand()*999999999,0))),
(57, 'Майлуу-Суу', 'ул. Маяк, 5', 'Кулинарное искусство'									,(round(rand()*999999999,0))),
(57, 'Иссык-Куль' , 'ул. Мечты, 17', 'Америкады ќе'											,(round(rand()*999999999,0))),
(58, 'Пекин', 'ул. Ляньху, 30', 'Пекинская Студия'											,(round(rand()*999999999,0))),
(58, 'Шанхай', 'ул. Порт, 13', 'Сельский рынок'												,(round(rand()*999999999,0))),
(58, 'Гуанчжоу', 'ул. Дзинсини, 34', 'Майя'													,(round(rand()*999999999,0))),
(58, 'Шэньчжэнь', 'ул. Ланьцзян, 4', 'Клуб финансовой доступности'							,(round(rand()*999999999,0))),
(58, 'Чэнду', 'ул. Гуйте, 26', 'Кухня Сиони'												,(round(rand()*999999999,0))),
(58, 'Тяньцзинь', 'ул. Шуньмэнь, 18', 'Мудрецы'												,(round(rand()*999999999,0))),
(58, 'Сиань', 'ул. Духовного пути, 12', 'Большая стена'										,(round(rand()*999999999,0))),
(58, 'Цзинань', 'ул. Боковой, 7', 'Дворец Куси'												,(round(rand()*999999999,0))),
(58, 'Луоянг', 'ул. Хуаншу, 15', 'Терпение'													,(round(rand()*999999999,0))),
(58, 'Чунцин', 'ул. Долинная, 9', 'Торговый центр'											,(round(rand()*999999999,0))),
(65, 'Вьентьян', 'ул. Просветления, 22', 'Кафе Сиды'										,(round(rand()*999999999,0))),
(65, 'Луангпрабанг', 'ул. Лотосовая, 10', 'Племенной фестиваль'								,(round(rand()*999999999,0))),
(65, 'Паксе', 'ул. Границы, 19', 'Философия истока'											,(round(rand()*999999999,0))),
(65, 'Саване', 'ул. Пещеры, 12', 'Старомодный стиль'										,(round(rand()*999999999,0))),
(65, 'Секонг', 'ул. Победителей, 7', 'Семенцы'												,(round(rand()*999999999,0))),
(65, 'Пхонгсали', 'ул. Реки, 23', 'Кубик кольца'											,(round(rand()*999999999,0))),
(65, 'Латхай', 'ул. Неля, 2', 'Гармония вкуса'												,(round(rand()*999999999,0))),
(65, 'Намтхунг', 'ул. Зелёная, 20', 'Крупное здн'											,(round(rand()*999999999,0))),
(65, 'Таунгвольд' , 'ул. Оратат, 14', 'Творческая гармонь'									,(round(rand()*999999999,0))),
(65, 'Пакхонг' , 'ул. Честная, 8', 'Зал Чудес'												,(round(rand()*999999999,0))),
(66, 'Рига', 'ул. Бривибас, 4', 'Латвийский музей'											,(round(rand()*999999999,0))),
(66, 'Юрмала', 'ул. Джанекса, 12', 'Юрмальская квартира'									,(round(rand()*999999999,0))),
(66, 'Лиепая', 'ул. Лиепайская, 6', 'Фестиваль Лиепая'										,(round(rand()*999999999,0))),
(66, 'Кулдига', 'ул. Фредерикса, 11', 'Летний лагерь'										,(round(rand()*999999999,0))),
(66, 'Даугавпилс', 'ул. Шиманевича, 8', 'Центр юря'											,(round(rand()*999999999,0))),
(66, 'Валмиера', 'ул. Надежда, 18', 'Круглый театр'											,(round(rand()*999999999,0))),
(66, 'Резекне', 'ул. Золотая, 5', 'Лаборатория'												,(round(rand()*999999999,0))),
(66, 'Гулбене', 'ул. Оранжевая, 2', 'Школа'													,(round(rand()*999999999,0))),
(66, 'Мадона', 'ул. Латвийская, 1', 'Кофейня'												,(round(rand()*999999999,0))),
(66, 'Алушта', 'ул. Найти, 14', 'Пиршествование'											,(round(rand()*999999999,0))),
(67, 'Масерене', 'ул. Тавишул, 3', 'Кофейня Пузырь'											,(round(rand()*999999999,0))),
(67, 'Брека', 'ул. Харьковская, 11', 'Сказки Пухера'										,(round(rand()*999999999,0))),
(67, 'Лесото', 'ул. Ураганная, 15', 'Чашка Чая'												,(round(rand()*999999999,0))),
(67, 'Монкло', 'ул. Ивне, 16', 'Царская Книга'												,(round(rand()*999999999,0))),
(67, 'Фрея', 'ул. Зверей, 52', 'Пиршествование'												,(round(rand()*999999999,0))),
(67, 'Лумера', 'ул. Хуфсай, 8', 'Лосось'													,(round(rand()*999999999,0))),
(67, 'Аплосон', 'ул. Байрок, 17', 'Истинная правда'											,(round(rand()*999999999,0))),
(67, 'Ботсвана', 'ул. Мото, 4', 'Ресторан Неприятности'										,(round(rand()*999999999,0))),
(67, 'Калос Левонья', 'ул. Небо, 10', 'Асп может а'											,(round(rand()*999999999,0))),
(67, 'Полагас кедры', 'ул. Замок, 25', 'Черта'												,(round(rand()*999999999,0))),
(68, 'Вильнюс', 'ул. Вильнюс, 8', 'Кафе Вильнюс'											,(round(rand()*999999999,0))),
(68, 'Ковно', 'ул. Солнце Золотое, 19', 'Музей Традиций'									,(round(rand()*999999999,0))),
(68, 'Клайпеда', 'ул. Яблонь, 12', 'Кораблекрушение'										,(round(rand()*999999999,0))),
(68, 'Шяуляй', 'ул. Складная, 8', 'Кукуруза'												,(round(rand()*999999999,0))),
(68, 'Паланга', 'ул. Чистая, 11', 'Рыбный рынок'											,(round(rand()*999999999,0))),
(68, 'Укмерге', 'ул. Возвращения, 4', 'Торговая сетка'										,(round(rand()*999999999,0))),
(68, 'Тракай', 'ул. Замок, 23', 'Площадь возрождения'										,(round(rand()*999999999,0))),
(68, 'Панеэ', 'ул. Костюмы, 7', 'Торговая сеть'												,(round(rand()*999999999,0))),
(68, 'Маруупите', 'ул. Молодежи, 44', 'Загадка'												,(round(rand()*999999999,0))),
(68, 'Заукь', 'ул. Душа, 9', 'Вдохновение'													,(round(rand()*999999999,0))),
(74, 'Бамако', 'ул. Мартыновых, 2', 'Музей Мали'											,(round(rand()*999999999,0))),
(74, 'Сигу', 'ул. Франа, 15', 'Галерея искусства'											,(round(rand()*999999999,0))),
(74, 'Коулокоро', 'ул. Ная, 9', 'Кафе'														,(round(rand()*999999999,0))),
(74, 'Себеку', 'ул. Легквз, 4', 'Смелые Искусства'											,(round(rand()*999999999,0))),
(74, 'Кикавар', 'ул. Дао, 7', 'Спортивный клуб'												,(round(rand()*999999999,0))),
(74, 'Гао', 'ул. Южная, 11', 'Клуб Водства'													,(round(rand()*999999999,0))),
(74, 'Кесера', 'ул. Автопилот, 3', 'Научный комитет'										,(round(rand()*999999999,0))),
(74, 'Коилигаа', 'ул. Бусин, 8', 'Восточные Бегемоты'										,(round(rand()*999999999,0))),
(74, 'Гераба', 'ул. Гулли, 2', 'Язык искусств'												,(round(rand()*999999999,0))),
(74, 'Темпли' , 'ул. Сметан, 19', 'Скандинавская свадьба'									,(round(rand()*999999999,0))),
(76, 'Валлетта', 'ул. Сент-Джорджа, 1', 'Мальтийская башня'									,(round(rand()*999999999,0))),
(76, 'Слиема', 'ул. Пооя, 3', 'Ресторан Елены'												,(round(rand()*999999999,0))),
(76, 'Моста', 'ул. Степанова, 50', 'Футбольный клуб'										,(round(rand()*999999999,0))),
(76, 'К эффективность', 'ул. Лотос, 18', 'Время человечества'								,(round(rand()*999999999,0))),
(76, 'Калкары', 'ул. Мир, 25', 'Маска'														,(round(rand()*999999999,0))),
(76, 'Забрака', 'ул. Фатимы, 4', 'Маленький Миф'											,(round(rand()*999999999,0))),
(76, 'Сан-паули', 'ул. Взгляда, 12', 'Кемпинги'												,(round(rand()*999999999,0))),
(76, 'Слиэбо', 'ул. Слиэбо, 22', 'Творческая жизнь'											,(round(rand()*999999999,0))),
(76, 'Церковь Святого Лаврентия', 'ул. Лондонского, 15', 'Мысли'							,(round(rand()*999999999,0))),
(76, 'Маленг', 'ул. Адмиральского, 8', 'Настоящий вкус'										,(round(rand()*999999999,0))),
(77, 'Мехико', 'ул. Лос-Тура, 45', 'Пасал Дель Злата'										,(round(rand()*999999999,0))),
(77, 'Гвадалахара', 'ул. Флорентино, 18', 'Кулинарные знакомства'							,(round(rand()*999999999,0))),
(77, 'Монтеррей', 'ул. Островная, 2', 'Фарм Дельиком'										,(round(rand()*999999999,0))),
(77, 'Пуэбла', 'ул. Мытища, 14', 'Розовый свет'												,(round(rand()*999999999,0))),
(77, 'Тихуана', 'ул. Небесной, 1', 'Клуб недавно'											,(round(rand()*999999999,0))),
(77, 'Канкун', 'ул. Группы, 3', 'Смелые мечты'												,(round(rand()*999999999,0))),
(77, 'Оахака', 'ул. Эспанолы, 7', 'Мясорубка'												,(round(rand()*999999999,0))),
(77, 'Сан-Луис-Потоси', 'ул. Капустиниана, 2', 'Гуиспарт'									,(round(rand()*999999999,0))),
(77, 'Гвадалахара', 'ул. Параллельная, 22', 'Гадания'										,(round(rand()*999999999,0))),
(77, 'Сакатекас', 'ул. Розовых, 28', 'Космический поток'									,(round(rand()*999999999,0))),
(78, 'Кишинев', 'ул. Мира, 25', 'Магазин своей идеи'										,(round(rand()*999999999,0))),
(78, 'Тирасполь', 'ул. Маяка, 9', 'Ташкент'													,(round(rand()*999999999,0))),
(78, 'Бельцы', 'ул. Рафаэля, 13', 'Кафе снижения'											,(round(rand()*999999999,0))),
(78, 'Рышкань', 'ул. Гензал, 22', 'Кружевой дом'											,(round(rand()*999999999,0))),
(78, 'Дрокия', 'ул. Полосатая, 5', 'Объединил'												,(round(rand()*999999999,0))),
(78, 'Фалешты', 'ул. Творчества, 14', 'Стиль мили'											,(round(rand()*999999999,0))),
(78, 'Сороки', 'ул. Фиалка, 2', 'РЕКС'														,(round(rand()*999999999,0))),
(78, 'Мадракешть', 'ул. Сарматис, 17', 'На тугу'											,(round(rand()*999999999,0))),
(78, 'Оргей', 'ул. Точки, 15', 'Творческие идеи'											,(round(rand()*999999999,0))),
(78, 'Шолдань', 'ул. Лота, 12', 'Новые горизонты'											,(round(rand()*999999999,0))),
(79, 'Монте-Карло', 'ул. Прекрасной Нати, 18', 'Каберет Афины'								,(round(rand()*999999999,0))),
(79, 'Монако', 'ул. Лунная, 9', 'Искусственная Цветы'										,(round(rand()*999999999,0))),
(79, 'Кап-д Ай', 'ул. Березовая, 24', 'Фестиваль Ретро'										,(round(rand()*999999999,0))),
(79, 'Ментон', 'ул. Печерская, 2', 'Небо'													,(round(rand()*999999999,0))),
(79, 'Ла-Турбье', 'ул. Баросень, 13', 'Редакция Статистики'									,(round(rand()*999999999,0))),
(79, 'Сент-Агата', 'ул. Лисовский, 5', 'Атлас'												,(round(rand()*999999999,0))),
(79, 'Маленькая буквка', 'ул. Вишневый, 24', 'Волшебный Пай'								,(round(rand()*999999999,0))),
(79, 'Тентин', 'ул. Зелёный, 1', 'Записи'													,(round(rand()*999999999,0))),
(79, 'Рокебрюн', 'ул. Червонцев, 14', 'Эскурсии'											,(round(rand()*999999999,0))),
(79, 'Ницца', 'ул. Вишневый, 8', 'Токийский стиль'											,(round(rand()*999999999,0))),
(80, 'Улан-Батор', 'ул. Оружия, 1', 'Музей наследия'										,(round(rand()*999999999,0))),
(80, 'Дархан', 'ул. Тысяча, 10', 'Культовый дом'											,(round(rand()*999999999,0))),
(80, 'Эрдэнэтийн', 'ул. Шумква, 50', 'Академия пространств'									,(round(rand()*999999999,0))),
(80, 'Булган', 'ул. Портчин-Худжир, 2', 'Спорт и движения'									,(round(rand()*999999999,0))),
(80, 'Завхан', 'ул. Видов, 7', 'Культурный центр'											,(round(rand()*999999999,0))),
(80, 'Сухбаатар', 'ул. Атласная, 4', 'Сила'													,(round(rand()*999999999,0))),
(80, 'Ховд', 'ул. Ливан, 30', 'Клиент'														,(round(rand()*999999999,0))),
(80, 'Дорнод', 'ул. Солнечная, 8', 'Находка'												,(round(rand()*999999999,0))),
(80, 'Говь-Алтай', 'ул. Небо, 2', 'Собрание'												,(round(rand()*999999999,0))),
(80, 'Улгей', 'ул. Зоя, 14', 'Моя преданность'												,(round(rand()*999999999,0))),
(83, 'Катманду', 'ул. Гуркхал, 33', 'Культурная ассоциация'									,(round(rand()*999999999,0))),
(83, 'Покхара', 'ул. Зеленоводный, 5', 'Нельсон'											,(round(rand()*999999999,0))),
(83, 'Лали-Гадж', 'ул. Долина, 23', 'Тайная тропа'											,(round(rand()*999999999,0))),
(83, 'Патан', 'ул. Серебряная, 9', 'Святой маяк'											,(round(rand()*999999999,0))),
(83, 'Бхактапур', 'ул. Рудник, 8', 'Водопад'												,(round(rand()*999999999,0))),
(83, 'Джонгшуд', 'ул. Гуркха, 14', 'Совет'													,(round(rand()*999999999,0))),
(83, 'Суркхет', 'ул. Т такоми, 4', 'Служба'													,(round(rand()*999999999,0))),
(83, 'Танаху', 'ул. Идол, 17', 'Гармония'													,(round(rand()*999999999,0))),
(83, 'Чатангу' , 'ул. Чави, 14', 'Изобилие'													,(round(rand()*999999999,0))),
(83, 'Налгад', 'ул. Лани, 16', 'Дерево'														,(round(rand()*999999999,0))),
(84, 'Ниамей', 'ул. Котабо, 8', 'Национальный музей'										,(round(rand()*999999999,0))),
(84, 'Мардид', 'ул. Бейт, 10', 'Кафе Авель'													,(round(rand()*999999999,0))),
(84, 'Зиндэр' , 'ул. Басима, 26', 'Творчество'												,(round(rand()*999999999,0))),
(84, 'Досо' , 'ул. Достон, 4', 'Туризм' 													,(round(rand()*999999999,0))),
(84, 'Кайе' , 'ул. Четыре, 11', 'Первая палата'												,(round(rand()*999999999,0))),
(84, 'Маджер' , 'ул. Хадиджа, 7', 'Философия'												,(round(rand()*999999999,0))),
(84, 'Гурджафилина' , 'ул. Слабая, 5', 'Национальная идея'									,(round(rand()*999999999,0))),
(84, 'Сабы' , 'ул. Гробу, 15', 'Музей картин'												,(round(rand()*999999999,0))),
(84, 'Текру' , 'ул. Красноглазый, 22', 'Кулинарная академия'								,(round(rand()*999999999,0))),
(84, 'Парана' , 'ул. Виноградов, 33', 'Старый смелый'										,(round(rand()*999999999,0))),
(87, 'Осло', 'ул. Акерсгет, 24', 'Кафе Норвегия'											,(round(rand()*999999999,0))),
(87, 'Берген', 'ул. Солстиг, 2', 'Картинная галерея'										,(round(rand()*999999999,0))),
(87, 'Ставангер', 'ул. Кюре, 5', 'Музей искусства'											,(round(rand()*999999999,0))),
(87, 'Тромсё', 'ул. Глория, 10', 'Полярный кукольный'										,(round(rand()*999999999,0))),
(87, 'Дрогедо', 'ул. Хювинг, 3', 'Галерея'													,(round(rand()*999999999,0))),
(87, 'Ларвик', 'ул. Ларвикская, 12', 'Национальная арена'									,(round(rand()*999999999,0))),
(87, 'Арендаль', 'ул. Пакаст, 18', 'Конференция'											,(round(rand()*999999999,0))),
(87, 'Копенгаген', 'ул. Майда, 25', 'Книжный центр'											,(round(rand()*999999999,0))),
(87, 'Хамар', 'ул. Шелли, 8', 'Кинотеатры'													,(round(rand()*999999999,0))),
(87, 'Лиллехамер', 'ул. Бетиг, 10', 'Национальный художественный музей'						,(round(rand()*999999999,0))),
(89, 'Маскат', 'ул. Пирамида, 2', 'Кофе Оман'												,(round(rand()*999999999,0))),
(89, 'Дукм', 'ул. Золотая, 5', 'Мусоросжигательный завод'									,(round(rand()*999999999,0))),
(89, 'Салаллах', 'ул. Маяк, 11', 'Пробуждение'												,(round(rand()*999999999,0))),
(89, 'Сур', 'ул. Событие, 8', 'Лурерхен'													,(round(rand()*999999999,0))),
(89, 'Мукасар', 'ул. Первая, 19', 'Една'													,(round(rand()*999999999,0))),
(89, 'Бибар', 'ул. Сланыра, 6', 'Эко-экспедишн'												,(round(rand()*999999999,0))),
(89, 'Далфур', 'ул. Сахаимай, 22', 'Реальность'												,(round(rand()*999999999,0))),
(89, 'Назарет', 'ул. Сканья, 26', 'Творить'													,(round(rand()*999999999,0))),
(89, 'Хиджель', 'ул. Рубина, 13', 'Творческая техника'										,(round(rand()*999999999,0))),
(89, 'Легенда', 'ул. Сиденья, 3', 'Кофе Центральный'										,(round(rand()*999999999,0))),
(90, 'Исламабад', 'ул. Индии, 20', 'Национальный совет'										,(round(rand()*999999999,0))),
(90, 'Карачи', 'ул. Креатив, 36', 'Умный двор'												,(round(rand()*999999999,0))),
(90, 'Лахор', 'ул. Асатт, 7', 'Лаборатории'													,(round(rand()*999999999,0))),
(90, 'Пешавар', 'ул. Лаунг, 8', 'Закусочная'												,(round(rand()*999999999,0))),
(90, 'Кветта', 'ул. Зозо, 4', 'Мост'														,(round(rand()*999999999,0))),
(90, 'Сурат', 'ул. Конфетный, 25', 'Пещера'													,(round(rand()*999999999,0))),
(90, 'Малихабад', 'ул. Лимон, 9', 'Оазис'													,(round(rand()*999999999,0))),
(90, 'Фейсалабад', 'ул. Славы, 3', 'Финария'												,(round(rand()*999999999,0))),
(90, 'Равалпинди', 'ул. Опер, 18', 'Фейерверк'												,(round(rand()*999999999,0))),
(90, 'Карачи', 'ул. Лотос, 16', 'Города'													,(round(rand()*999999999,0))),
(96, 'Москва', 'ул. Тверская, 14', 'Госдума'												,(round(rand()*999999999,0))),
(96, 'Санкт-Петербург', 'ул. Невский, 32', 'Эрмитаж'										,(round(rand()*999999999,0))),
(96, 'Новосибирск', 'ул. Красный проспект, 50', 'Культурный центр'							,(round(rand()*999999999,0))),
(96, 'Екатеринбург', 'ул. Ленина, 23', 'Президент-отель'									,(round(rand()*999999999,0))),
(96, 'Казань', 'ул. Баумана, 22', 'Театр кукол'												,(round(rand()*999999999,0))),
(96, 'Нижний Новгород', 'ул. Большая Покровская, 12', 'Галерея'								,(round(rand()*999999999,0))),
(96, 'Самара', 'ул. Куйбышева, 10', 'Кинотеатр'												,(round(rand()*999999999,0))),
(96, 'Ростов-на-Дону', 'ул. Сура, 4', 'ТЦ Мега'												,(round(rand()*999999999,0))),
(96, 'Воронеж', 'ул. Пушкина, 5', 'Музей Братска'											,(round(rand()*999999999,0))),
(96, 'Уфа', 'ул. Мира, 20', 'Магазин путешественников'										,(round(rand()*999999999,0))),
(97, 'Бухарест', 'ул. центра, 8', 'Национальный музей'										,(round(rand()*999999999,0))),
(97, 'Клуж-Напока', 'Аэропорт, 9', 'Кафе Двери'												,(round(rand()*999999999,0))),
(97, 'Яссы', 'ул. Карды, 15', 'Лужа'														,(round(rand()*999999999,0))),
(97, 'Тимишоара' , 'ул. Институтская, 6', 'Сосновые аллеи'									,(round(rand()*999999999,0))),
(97, 'Крайова' , 'ул. Саренди, 18', 'Торбоньок'												,(round(rand()*999999999,0))),
(97, 'Галац' , 'ул. Ноганова, 14', 'Национальная галерея'									,(round(rand()*999999999,0))),
(97, 'Брэила' , 'ул. Геллозовская, 30', 'Сцена'												,(round(rand()*999999999,0))),
(97, 'Питешть' , 'ул. Верментаба, 7', 'Площадь Солнца'										,(round(rand()*999999999,0))),
(97, 'Тыргу-Муреш' , 'ул. Бразильская, 28', 'Парашютистский клуб'							,(round(rand()*999999999,0))),
(97, 'Сибиу' , 'ул. Шумейкина, 25', 'Гаризонная артель'										,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Лотусовая, 10', 'Чайный дом'											,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Солнце, 15', 'Торговая мряка'										,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Баухан, 22', 'Парк'													,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Ривьере, 29', 'Отель Arcadia'										,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Кривоногова, 3', 'Гриль'												,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Богдавич, 11', 'Студия'												,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Формирующая, 22', 'Библиотека'										,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Шевилинка, 7', 'Песни'												,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Сетра, 1', 'Гармония'												,(round(rand()*999999999,0))),
(100, 'Сингапур', 'ул. Может, 14', 'Чудеса'													,(round(rand()*999999999,0))),
(101, 'Братислава', 'ул. Явора, 20', 'Сладкий Лавра'										,(round(rand()*999999999,0))),
(101, 'Кошице', 'ул. Норильская, 11', 'Магазин хороших эмоций'								,(round(rand()*999999999,0))),
(101, 'Приевидза', 'ул. Дубрук, 4', 'Кафе Сказочное'										,(round(rand()*999999999,0))),
(101, 'Жилина', 'ул. Многофункциональная, 7', 'Школа искусств'								,(round(rand()*999999999,0))),
(101, 'Нитра', 'ул. Лужу, 23', 'Кафе Вера'													,(round(rand()*999999999,0))),
(101, 'Тренчин' , 'ул. Гуджортская, 9', 'Кафе надежды'										,(round(rand()*999999999,0))),
(101, 'Попрад' , 'ул. Тигр, 8', 'Кофейня Золотое'											,(round(rand()*999999999,0))),
(101, 'Левочи' , 'ул. Еловая, 10', 'Галерея'												,(round(rand()*999999999,0))),
(101, 'Косице' , 'ул. Пробуждение, 5', 'Долгожданный'										,(round(rand()*999999999,0))),
(101, 'Кошице' , 'ул. Печная, 14', 'Интерьеры разговора'									,(round(rand()*999999999,0))),
(102, 'Любляна', 'ул. Тартинья, 29', 'Кафе Меланж'											,(round(rand()*999999999,0))),
(102, 'Марибор', 'ул. Габровая, 18', 'Магазин Счастья'										,(round(rand()*999999999,0))),
(102, 'Целе', 'ул. Волшебная, 16', 'Книга ожиданий'											,(round(rand()*999999999,0))),
(102, 'Новогрдель' , 'ул. Sarajevo, 4', 'Путешествие'										,(round(rand()*999999999,0))),
(102, 'Совина' , 'ул. Мечтателей, 27', 'Недавно'											,(round(rand()*999999999,0))),
(102, 'Помурие' , 'ул. Комнаты, 10', 'Летний сад'											,(round(rand()*999999999,0))),
(102, 'Новака' , 'ул. Аромата, 25', 'Завершение'											,(round(rand()*999999999,0))),
(102, 'Идрица' , 'ул. Esto, 2', 'Книжный журнал'											,(round(rand()*999999999,0))),
(102, 'Обечна' , 'ул. Президиума, 30', 'Регистрация'										,(round(rand()*999999999,0))),
(102, 'Славенська' , 'ул. Привязанных, 14', 'Летний сад'									,(round(rand()*999999999,0))),
(103, 'Могадишо', 'ул. Успокаивающих, 5', 'Неназванный'										,(round(rand()*999999999,0))),
(103, 'Босасо', 'ул. Бокарты, 14', 'Сенситивный дом'										,(round(rand()*999999999,0))),
(103, 'Кисмаю' , 'ул. Сучайм, 22', 'Дзен'													,(round(rand()*999999999,0))),
(103, 'Сомали' , 'ул. солнечного, 9', 'Культура'											,(round(rand()*999999999,0))),
(103, 'Дхусамареб' , 'ул. Кстати, 1', 'Творческий клуб'										,(round(rand()*999999999,0))),
(103, 'Мерка' , 'ул. Зверобой, 7', 'Морская лавка'											,(round(rand()*999999999,0))),
(103, 'Лас-анод' , 'ул. Гая, 14', 'Кукольные'												,(round(rand()*999999999,0))),
(103, 'Афгун' , 'ул. Асмар, 12', 'Лабораторная практика'									,(round(rand()*999999999,0))),
(103, 'Балад' , 'ул. Петровская, 5', 'Кураж'												,(round(rand()*999999999,0))),
(103, 'Ластичин' , 'ул. Рыба, 17', 'Не вляженный'											,(round(rand()*999999999,0))),
(104, 'Хартум', 'ул. Лотосовая, 13', 'Фармацевтика'											,(round(rand()*999999999,0))),
(104, 'Омдурман', 'ул. Катрин, 16', 'Круглый стол'											,(round(rand()*999999999,0))),
(104, 'Эль-Обеид', 'ул. Площади, 4', 'Легкий размозг'										,(round(rand()*999999999,0))),
(104, 'Даллу' , 'ул. Раннее, 20', 'Совет'													,(round(rand()*999999999,0))),
(104, 'Гаджура' , 'ул. Лагана, 9', 'Изуми'													,(round(rand()*999999999,0))),
(104, 'Бурри' , 'ул. Цветная, 11', 'Магазин тканей'											,(round(rand()*999999999,0))),
(104, 'Сеннар' , 'ул. Хельвети, 12', 'Стратегия'											,(round(rand()*999999999,0))),
(104, 'Альфайо' , 'ул. Путешествия, 6', 'Дзен'												,(round(rand()*999999999,0))),
(104, 'Джуба' , 'ул. Зеленая, 3', 'Свет камеры'												,(round(rand()*999999999,0))),
(104, 'Порт-Судан' , 'ул. Золотая, 1', 'Кружево'											,(round(rand()*999999999,0))),
(106, 'Бангкок', 'ул. Чао Прайя, 35', 'Бангкокская карта'									,(round(rand()*999999999,0))),
(106, 'Паттайя', 'ул. Рай, 10', 'Тайская кухня'												,(round(rand()*999999999,0))),
(106, 'Чиангмай', 'ул. Зодчий, 44', 'Матовая картинка'										,(round(rand()*999999999,0))),
(106, 'Пхукет', 'ул. Вокруг, 6', 'Тайское заведение'										,(round(rand()*999999999,0))),
(106, 'Краби', 'ул. Кулага, 17', 'Благодарный куст'											,(round(rand()*999999999,0))),
(106, 'Ай-Нан' , 'ул. Шумный, 23', 'Тайская звезда'											,(round(rand()*999999999,0))),
(106, 'Трат' , 'ул. Луна, 13', 'Мост'														,(round(rand()*999999999,0))),
(106, 'Удонтхани' , 'ул. Долларовая, 2', 'Достогрыжание'									,(round(rand()*999999999,0))),
(106, 'Накхонратчасима' , 'ул. Рынок, 8', 'Турист'											,(round(rand()*999999999,0))),
(106, 'Краби' , 'ул. Краби, 19', 'Ресурсы'													,(round(rand()*999999999,0))),
(107, 'Тайбэй', 'ул. Гоа, 6', 'Тайваньская особая'											,(round(rand()*999999999,0))),
(107, 'Кайсюн', 'ул. Лозунг, 15', 'Западный квартал'										,(round(rand()*999999999,0))),
(107, 'Тайнан', 'ул. Ило, 26', 'Восточный отель'											,(round(rand()*999999999,0))),
(107, 'Тайчжун', 'ул. Синьцзян, 12', 'Еда из яиц'											,(round(rand()*999999999,0))),
(107, 'Туньчань', 'ул. Неба, 23', '815 прозы'												,(round(rand()*999999999,0))),
(107, 'Пиндун' , 'ул. Долина, 10', 'Древнее научное'										,(round(rand()*999999999,0))),
(107, 'Лаочжа' , 'ул. Конгста, 4', 'Тайваньский бутик'										,(round(rand()*999999999,0))),
(107, 'Сюйчжоу' , 'ул. Градская, 11', 'Шедевры'												,(round(rand()*999999999,0))),
(107, 'Шуйчжэн' , 'ул. Секрет, 25', 'Легендарный'											,(round(rand()*999999999,0))),
(107, 'Нантоу' , 'ул. Вопросы, 21', 'Скрипки'												,(round(rand()*999999999,0))),
(111, 'Анкара', 'ул. Ататюрка, 15', 'Исполком'												,(round(rand()*999999999,0))),
(111, 'Стамбул', 'ул. Топкапы, 12', 'Клуб Огонь'											,(round(rand()*999999999,0))),
(111, 'Измир', 'ул. Фирма, 28', 'Общий дом'													,(round(rand()*999999999,0))),
(111, 'Анталья', 'ул. Памуккале, 7', 'Восточные споры'										,(round(rand()*999999999,0))),
(111, 'Бурса', 'ул. Булар, 13', 'Пироги'													,(round(rand()*999999999,0))),
(111, 'Конья', 'ул. Резо, 5', 'Творчество'													,(round(rand()*999999999,0))),
(111, 'Адана', 'ул. Мысва, 8', 'Рынок Адана'												,(round(rand()*999999999,0))),
(111, 'Газипаша', 'ул. Тени, 9', 'Забавы'													,(round(rand()*999999999,0))),
(111, 'Диярбакыр', 'ул. Бильмес, 11', 'Центр Мира'											,(round(rand()*999999999,0))),
(111, 'Самсун', 'ул. Ней әпере, 4', 'Оценивающее'											,(round(rand()*999999999,0))),
(112, 'Кампала', 'ул. Солнечная, 11', 'Подходы'												,(round(rand()*999999999,0))),
(112, 'Нараоби', 'ул. Блийз, 32', 'граница'													,(round(rand()*999999999,0))),
(112, 'Мпиги', 'ул. Эндере, 3', 'Наследия'													,(round(rand()*999999999,0))),
(112, 'Масинди', 'ул. Образовательная, 8', 'Углубление'										,(round(rand()*999999999,0))),
(112, 'Касесе', 'ул. Хейбол, 14', 'Советы'													,(round(rand()*999999999,0))),
(112, 'Лугананго', 'ул. Заходы, 16', 'Социальные действия'									,(round(rand()*999999999,0))),
(112, 'Кампала', 'ул. Жизням, 20', 'Времена'												,(round(rand()*999999999,0))),
(112, 'Касесе', 'ул. Пьяный, 24', 'Семейные истоки'											,(round(rand()*999999999,0))),
(112, 'Калака', 'ул. Параде, 18', 'Парады'													,(round(rand()*999999999,0))),
(112, 'Намалике', 'ул. Мироздания, 14', 'Светлый релакс'									,(round(rand()*999999999,0))),
(121, 'Нджамена', 'ул. Руда, 8', 'Кафе Бонда'												,(round(rand()*999999999,0))),
(121, 'Массауа', 'ул. Партизанскую, 10', 'Фестивали'										,(round(rand()*999999999,0))),
(121, 'Думфур' , 'ул. Тосила, 6', 'Гармония'												,(round(rand()*999999999,0))),
(121, 'Абеше' , 'ул. Лотосная, 11', 'Африканская еда'										,(round(rand()*999999999,0))),
(121, 'Эль-Генина' , 'ул. Гриву, 3', 'Чай'													,(round(rand()*999999999,0))),
(121, 'Касала' , 'ул. Крейдер, 7', 'Суп'													,(round(rand()*999999999,0))),
(121, 'Малам` вильямс' , 'ул. Пригороды, 25', 'Кафе Книги'									,(round(rand()*999999999,0))),
(121, 'Залинда' , 'ул. Взгляда, 17', 'Национальный институт'								,(round(rand()*999999999,0))),
(121, 'Генкава' , 'ул. Золотая, 4', 'Заводы'												,(round(rand()*999999999,0))),
(121, 'Эль-Фашер' , 'ул. Листвиной, 9', 'Стиль'												,(round(rand()*999999999,0))),
(122, 'Прага', 'ул. Вацлава, 11', 'Клуб волшебника'											,(round(rand()*999999999,0))),
(122, 'Чехия', 'ул. Чешская, 2', 'Кафе Комета'												,(round(rand()*999999999,0))),
(122, 'Брно' , 'ул. Хлебная, 20', 'Большой рынок'											,(round(rand()*999999999,0))),
(122, 'Острава' , 'ул. Солнечная, 5', 'Магазин шуток'										,(round(rand()*999999999,0))),
(122, 'Градец-Кралове' , 'ул. Пиларская, 15', 'Ресторан шедевров'							,(round(rand()*999999999,0))),
(122, 'Усти-над-Лабем' , 'ул. Замковая, 29', 'Творчески волшебный'							,(round(rand()*999999999,0))),
(122, 'Ческе-Будеевице' , 'ул. Саженец, 3', 'Кафе Долгожданный'								,(round(rand()*999999999,0))),
(122, 'Пльзень' , 'ул. Лабисьев, 14', 'Майонез'												,(round(rand()*999999999,0))),
(122, 'Гавиржов' , 'ул. Котушка, 6', 'Солостоверный'										,(round(rand()*999999999,0))),
(122, 'Злин' , 'ул. Детский, 23', 'Творится'												,(round(rand()*999999999,0))),
(123, 'Сантьяго', 'ул. Местровая, 17', 'Кладбище'											,(round(rand()*999999999,0))),
(123, 'Вальпараисо', 'ул. Лос-Вайес, 12', 'Круглый зал'										,(round(rand()*999999999,0))),
(123, 'Кунко' , 'ул. Солнечная, 6', 'Снежный крест'											,(round(rand()*999999999,0))),
(123, 'Антофагаста' , 'ул. Мост, 3', 'Торговая линия'										,(round(rand()*999999999,0))),
(123, 'Копьяпо' , 'ул. Травяная, 40', 'Изумруд'												,(round(rand()*999999999,0))),
(123, 'Биябле' , 'ул. Наш дом, 15', 'Дерево'												,(round(rand()*999999999,0))),
(123, 'Талька' , 'ул. Инженерная, 9', 'Поросенок'											,(round(rand()*999999999,0))),
(123, 'Пунта-Аренас' , 'ул. Лючо, 22', 'Артистическая Оборона'								,(round(rand()*999999999,0))),
(123, 'Ла-Серена' , 'ул. Ветра, 8', 'Зайцы'													,(round(rand()*999999999,0))),
(123, 'Арика' , 'ул. Спокойная, 19', 'Арены'												,(round(rand()*999999999,0))),
(125, 'Стокгольм', 'ул. Кунгсгатан, 31', 'Шведский стол'									,(round(rand()*999999999,0))),
(125, 'Гётеборг', 'ул. Амин, 25', 'Бренды'													,(round(rand()*999999999,0))),
(125, 'Мальмё', 'ул. Столькая, 12', 'Торговля'												,(round(rand()*999999999,0))),
(125, 'Уппсала', 'ул. Королевская, 19', 'Польза'											,(round(rand()*999999999,0))),
(125, 'Оре', 'ул. Ласка, 10', 'Магазин'														,(round(rand()*999999999,0))),
(125, 'Лундал', 'ул. Солнечная, 18', 'Суп'													,(round(rand()*999999999,0))),
(125, 'Хельсингборг', 'ул. Синк, 27', 'Причал'												,(round(rand()*999999999,0))),
(125, 'Калмар', 'ул. Мерак, 22', 'Университет'												,(round(rand()*999999999,0))),
(125, 'Эребру', 'ул. Овощ, 4', 'Клубы'														,(round(rand()*999999999,0))),
(125, 'Ландскрон' , 'ул. Теней, 5', 'Гармония'												,(round(rand()*999999999,0))),
(128, 'Таллин', 'ул. Яан, 4', 'Кофейная музеи'												,(round(rand()*999999999,0))),
(128, 'Тарту', 'ул. Уютная, 35', 'Совет'													,(round(rand()*999999999,0))),
(128, 'Калленагр', 'ул. Яфет, 12', 'Гармония'												,(round(rand()*999999999,0))),
(128, 'Лаймагалн' , 'ул. Уютная, 4', 'Огромные непутевцы'									,(round(rand()*999999999,0))),
(128, 'Айра' , 'ул. Ларнака, 15', 'Ларек'													,(round(rand()*999999999,0))),
(128, 'Лучково' , 'ул. Мира, 8', 'Кулинарная'												,(round(rand()*999999999,0))),
(128, 'Хаапсалу' , 'ул. Перева, 17', 'Западный путь'										,(round(rand()*999999999,0))),
(128, 'Салга' , 'ул. Шляхетная, 3', 'Энергия'												,(round(rand()*999999999,0))),
(128, 'Сервис' , 'ул. Разведывательная, 14', 'Гармония'										,(round(rand()*999999999,0))),
(128, 'Серпель' , 'ул. Города, 26', 'Фантики'												,(round(rand()*999999999,0))),
(131, 'Токио', 'ул. Императорская, 1', 'Кафе Сунн'											,(round(rand()*999999999,0))),
(131, 'Осака', 'ул. Зеленые деревья, 3', 'Магазин искусства'								,(round(rand()*999999999,0))),
(131, 'Киото', 'ул. Мира, 9', 'Сун Тэн'														,(round(rand()*999999999,0))),
(131, 'Хиросима', 'ул. Цветочная, 14', 'Цветы Японии'										,(round(rand()*999999999,0))),
(131, 'Нагойя', 'ул. Мелодия, 12', 'Лагерь'													,(round(rand()*999999999,0))),
(131, 'Кавасаки', 'ул. Чудеса, 23', 'Национальный торг'										,(round(rand()*999999999,0))),
(131, 'Фукуока', 'ул. Ооке, 11', 'Дегустация'												,(round(rand()*999999999,0))),
(131, 'Кобе', 'ул. Души, 27', 'Сигурд'														,(round(rand()*999999999,0))),
(131, 'Саппоро', 'ул. Затменье, 8', 'Организация Мирового рынка'                            ,(round(rand()*999999999,0)))
--rollback 
commit


use Magaz_DB
go
set nocount,xact_abort on
go

--select * from #t 
drop table if exists #t
create table #t (ID_Branch bigint null,Mail nvarchar(300) null,Phone nvarchar(15) null,Postal_Code int null,[Description] nvarchar(1000) null, flag int null)

begin tran
declare @q int  =0;
    while @q < = 579
	    begin
            insert into #t  (ID_Branch,Mail,Phone,Postal_Code,[Description],flag) 
			values 
			(
			(@q),
			(case when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@yandex.ru'
                  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@mail.ru'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@mail.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@gmail.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@yahoo.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@hotmail.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@live.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@icloud.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@moore@mail.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@tutanota.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@mydomain.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@dr.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@live.co.uk'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@sharklasers.com'
            	  when cast(round(rand()*7,0) as nvarchar(10)) = 7 then REPLACE(SUBSTRING(CONVERT(varchar(36), NEWID()), 1, convert(int,ROUND(rand()*120,0))), '-', '') + '@uol.com.br'
            ELSE N'Email не указан' END),
		   (case when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(912)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
				 when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(962)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
				 when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(495)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
				 when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(928)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
				 when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(988)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
				 when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(953)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
				 when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(374)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
				 when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(798)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
				 when cast(round(rand()*4,0) as nvarchar(3)) = 4  then '(912)'  + REPLACE(STR(cast(round(rand()*999,0) as nvarchar(6)),3,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0') + '-' + REPLACE(STR(cast(round(rand()*99,0) as nvarchar(2)),2,0),' ','0')
			else '' end),
			round(rand()*99999,0),
		   (case  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Отличное место для шопинга!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Персонал всегда дружелюбный и отзывчивый.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Удобное расположение и большой выбор!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Здесь приятно проводить время с семьей.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Качество услуг на высоте!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Все очень быстро и удобно.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Приятные акции и скидки!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Чистота и порядок на высшем уровне.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Рекомендую всем, кто любит качественные товары.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Здесь всегда свежие продукты.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Удобный график работы, всем подойдет.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'В этом филиале очень уютно.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Вежливый персонал всегда готов помочь.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Мне нравится выбирать подарки здесь.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Выгодные предложения и низкие цены.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Отличное обслуживание, так держать!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Достаточно парковочных мест.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Кассирам требуется немного больше тренировки.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Изменения в интерьере, мне нравится!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Есть все, что нужно для дома.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Там всегда много покупателей - значит, все отлично!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Никогда не бывает длинных очередей.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Покупала здесь продукцию и осталась довольна.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Комфортная атмосфера для покупок.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Безопасно и удобно.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Ну очень горячая кулинария, рекомендую!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Приятно находиться в этом филиале.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Уникальные товары, которые не найдешь в других местах.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Ассортимент постоянно обновляется.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Клиенты чувствуют себя здесь как дома.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Хорошей звучание музыки в магазине.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Скорость обслуживания просто впечатляет.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Разнообразие товаров радует глаз.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Уже много лет я постоянный клиент!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Оплата очень удобная и быстрая.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Я всегда нахожу здесь всё, что нужно.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Спокойная атмосфера для шопинга.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Были здесь разные альтернативы.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Во время распродаж вообще отлично!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Здесь работают настоящие профессионалы.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Сколько людей, а обслуживают быстро!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Атмосфера очень дружелюбная и расслабляющая.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Всегда приятно возвращаться сюда.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Я часто рекомендую этот филиал своим друзьям.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Много полезных товаров по разумным ценам.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Ассортимент просто невероятный.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Выбор одежды очень порадовал.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Ждем новых поступлений товара!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Всё, что угодно, можно найти здесь.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Посетила с дочкой, остались в восторге!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Все очень аккуратно и организованно.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Приходите! Здесь всегда весело.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Иногда бывает многолюдно, но это не страшно.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Постоянно появляются новинки, это радует.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Лучшие места для покупок в городе!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Всё организовано удобно.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Приятно видеть, что заботятся о клиентах.'
                  when cast(round(rand()*4,0) as nvarchar(3))=100 then'Я счастлива от шопинга здесь.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Здесь можно найти подарки на любой случай.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Проходит много интересных акций и мероприятий.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Заботятся о клиентах, всегда на связи!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Клиентский сервис на высшем уровне.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Санитарные нормы соблюдаются, приятно видеть.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Я часто провожу время здесь, выбирая покупки.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Изобилие выбора по карману каждому.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Приятно заходить не только за покупками.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Некоторые вещи можно купить только здесь!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Хотелось бы больше спортивной одежды.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Сделают всё возможное, чтобы удовлетворить клиента.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Улыбка на лице сотрудников - это приятно.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Супер качественные товары по разумным ценам.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Каждый раз что-то новенькое встречаю.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Какой же широкий выбор игрушек!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Приятно удивлён разнообразием канцелярии.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Эти отделы просто находка для любителей кулинарии.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Очень стильные вещи для современных молодежи.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Большое спасибо за службу поддержки.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Каждый раз такие разнообразные новинки.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Замечательно, что флора и фауна также представлены.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Спокойно делать покупки с маленьким ребёнком.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Доставка тоже работает отлично.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Отличное соотношение качества и цены.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Никогда не покидала ни с пустыми руками.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Легко ориентироваться в магазине.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Я счастлива, что открыли новый филиал.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Эта сеть меня никогда не подводила.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Регулярно открываются новые распродажи.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Магазин удобно расположен рядом с метро.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Не пожалела, что пришла сюда.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Здесь я нашла именно то, что искала.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Товар всегда свежий и качественный.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Всегда много интересных акций.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Отличный сервис на кассе.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Всё для дома под одной крышей!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Приятные бонусы для постоянных клиентов.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Читаю отзывы и спешу повторить покупку.'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Филиал делает настоящие одежды.'
                  when cast(round(rand()*4,0) as nvarchar(3))=5 then'Здесь есть даже оружие для кухни!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'Чудесные лютые распродажи!'
                  when cast(round(rand()*4,0) as nvarchar(3))=4 then'С нетерпением жду следующего визита'
	        else '' end),
			0
            );
			set @q = @q + 1
			print ' Добавлено строк' +  ' - число   ' + convert(nvarchar(10),@q);
	   end;
--rollback
commit
go



use Magaz_DB
go
set nocount,xact_abort on
go
begin tran
declare @i int = 0, @s int = 0 , @n varchar(40), @mess varchar(8000), @err varchar(1000)

declare
@ID_Branch       bigint  
,@Id_Country     bigint       
,@City         	 nvarchar(100)
,@Address    	 nvarchar(300)
,@Name_Branch  	 nvarchar(300)
,@Mail           nvarchar(300)
,@Phone          nvarchar(15)
,@Postal_Code    int
,@INN            int	
,@Description    nvarchar(1000)
,@flag           int
declare mycur cursor local fast_forward read_only for

select 
 b.ID_Branch    
,b.Id_Country   
,b.City         
,b.[Address]    
,b.Name_Branch  
,t.Mail         
,t.Phone        
,t.Postal_Code  
,b.INN          
,t.[Description]
,0 as flag 
from #t t inner join Branch b on b.ID_Branch = t.ID_Branch


open mycur
fetch next from mycur into
@ID_Branch   
,@Id_Country 
,@City       
,@Address    
,@Name_Branch
,@Mail       
,@Phone      
,@Postal_Code
,@INN        
,@Description
,@flag 
while @@FETCH_STATUS  = 0
               -- (0,-1,-2,-9) столбец fetch_status функции динамического управления sys.dm_exec_cursors
			   -- 0 Инструкция FETCH была выполнена успешно.
			   ---1	Выполнение инструкции FETCH завершилось неудачно или строка оказалась вне пределов результирующего набора.
			   ---2	Выбранная строка отсутствует.
			   --–9	Курсор не выполняет операцию выборки.
    begin
	  begin try
	      begin tran
			   update   b
			   set Id_Country = @Id_Country from  Branch as b
			   where  Id_Branch = @Id_Branch
			   update   c
			   set City = @City from  Branch as c
			   where  Id_Branch = @Id_Branch
			   update   d
			   set [Address] = @Address from  Branch as d
			   where  Id_Branch = @Id_Branch
			   update   e
			   set Name_Branch = @Name_Branch from  Branch as e
			   where  Id_Branch = @Id_Branch
			   update   f
			   set Mail = @Mail from  Branch as f
			   where  Id_Branch = @Id_Branch
			   update   g
			   set Phone = @Phone from  Branch as g
			   where  Id_Branch = @Id_Branch
			   update   h
			   set Postal_Code = @Postal_Code from  Branch as h
			   where  Id_Branch = @Id_Branch
			   update   j
			   set INN = @INN from  Branch as j
			   where  Id_Branch = @Id_Branch
			   update   k
			   set [Description] = @Description from  Branch as k
			   where  Id_Branch = @Id_Branch
			  set @i =  @i + 1
			  if exists (select * 
			             from Branch 
			             where 1 =1
			             and  Mail = @Mail
						 and  Phone = @Phone
						 and  Postal_Code = @Postal_Code
						 and  [Description] = @Description
						 )  begin update m set flag = 1 from #t  as m where ID_Branch = @ID_Branch and flag = 0 end
          --rollback
		  commit
			  select @s = count(0) from #t where flag = 0
			  set @n = (select  
			            case  t.flag  when 1 then ' 1  Значения внесены' when 0  then ' 0  Значения не изменились' end  
			            from #t t  where ID_Branch = @ID_Branch)
			  set @mess = @n + ' - > ' +  ' Объект ' + cast(@ID_Branch as varchar)  +  ' --> ' + ' - ' + Cast(@i as varchar) + ' / ' + Cast(@s as varchar)
			  RAISERROR(@mess,0,0) WITH NOWAIT

       end try

	   begin catch
                if @@trancount > 0
                begin
                   rollback;
                end;
                
                set @err = formatmessage(N'ID=%I64d, error - %s', @ID_Branch, error_message());
                print @err;
       end catch;
            	   

	fetch next from mycur into 
	@ID_Branch   
	,@Id_Country 
	,@City       
	,@Address    
	,@Name_Branch
	,@Mail       
	,@Phone      
	,@Postal_Code
	,@INN        
	,@Description
	,@flag
	end
close mycur
deallocate mycur
--rollback
commit

